routes/web.php

select * from `users`
---
    return view('welcome');
});

Route::get('/users', function() {
    $users = User::all();
    return view('test', compact('users'));
});