app/Http/Controllers/AddToCartController.php

select * from `products` where `products`.`id` = '2' limit 1
---
    function store(Request $request, $id) {

       $product = Product::findOrFail($id);