app/Http/Controllers/ProductController.php

    public function index()
    {
        $products = Product::all();
---
select * from `products`

    public function store(ProductStoreRequest $request)
    {
        $product = new Product();

        if ($request->hasFile('image')) {
            $image = $request->file('image');
            $fileName = $image->store('', 'public');
            $filePath = 'uploads/' . $fileName;
            $product->image = $filePath;
        }

        $product->name = $request->name;
        $product->price = $request->price;
        $product->short_description = $request->short_description;
        $product->qty = $request->qty;
        $product->sku = $request->sku;
        $product->description = $request->description;
        $product->save();

        // insert colors
        if ($request->has('colors') && $request->filled('colors')) {
            foreach ($request->colors as $color) {
                ProductColor::create([
                    'product_id' => $product->id,
                    'name' => $color
                ]);
---
insert into `product_colors` (`product_id`, `name`, `updated_at`, `created_at`) values (2, 'green', '2024-08-24 09:32:07', '2024-08-24 09:32:07')

                // store image
                $fileName = $image->store('', 'public');
                $filePath = 'uploads/' . $fileName;
                ProductImage::create([
                    'product_id' => $product->id,
                    'path' => $filePath
                ]);
---
insert into `product_images` (`product_id`, `path`, `updated_at`, `created_at`) values (2, 'uploads/3fKj1IoX2eA8Y6vcP97ZH5TI4KTcSrIvDMWvphtt.jpg', '2024-08-24 09:32:07', '2024-08-24 09:32:07')

    public function edit(string $id)
    {
        $product = Product::with(['colors', 'images'])->findOrFail($id);
---
select * from `products` where `products`.`id` = '1' limit 1

    public function destroy(string $id)
    {
        $product = Product::findOrFail($id);
        $product->colors()->delete();
        File::delete(public_path($product->image));
        foreach($product->images as $image) {
            File::delete(public_path($image->path));
        }
        $product->delete();
---
select * from `products` where `products`.`id` = '4' limit 1
delete from `product_colors` where `product_colors`.`product_id` = 4 and `product_colors`.`product_id` is not null
delete from `products` where `id` = 4