app/Http/Controllers/ProductPageController.php

    function index() {

        $products = Product::all();
---
select * from `products`

    function show($id) {
        $product = Product::findOrFail($id);
---
select * from `products` where `products`.`id` = '2' limit 1